app/controllers/admin_controller.rb

SELECT "posts".* FROM "posts"
SELECT "projects".* FROM "projects"
---
  def index
    @user = User.new
    @posts = Post.all
    @projects = Project.all