app/controllers/images_controller.rb

    def set_image
      @image = Image.find(params[:id])
---
SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", 0]]