app/controllers/picks_controller.rb

SELECT "picks".* FROM "picks"
---
  def index
    @picks = Pick.all