app/controllers/posts_controller.rb

  def index
    @posts = Post.search(params[:search], params[:page])
---
SELECT  "posts".* FROM "posts" WHERE (title LIKE '%%')  ORDER BY created_at DESC LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "posts" WHERE (title LIKE '%%')

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "dek", "body", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Test Title"], ["dek", "Test Dek"], ["body", "Test Body"], ["image", "test_image.png"], ["created_at", "2015-02-11 20:52:08.911937"], ["updated_at", "2015-02-11 20:52:08.911937"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "image" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["image", "https://i1.creativecow.net/u/201214/800px-ibm_pc_5150.jpg"], ["updated_at", "2015-02-11 22:13:01.308115"], ["id", 1]]

    def set_post
      @post = Post.friendly.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]