app/controllers/projects_controller.rb

  def index
    # @projects = Project.all
    @projects = Project.search(params[:search], params[:page])
---
SELECT "projects".* FROM "projects"

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "body" = $1, "image" = $2, "updated_at" = $3 WHERE "projects"."id" = $4  [["body", "This is a test."], ["image", "https://pbs.twimg.com/media/B8m-QMaIIAAJlcb.jpg"], ["updated_at", "2015-02-20 17:39:19.696664"], ["id", 1]]

    def set_project
      @project = Project.friendly.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 1]]