app/controllers/welcome_controller.rb

SELECT  "posts".* FROM "posts" WHERE (title LIKE '%%')  ORDER BY created_at DESC LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "posts" WHERE (title LIKE '%%')
SELECT  "projects".* FROM "projects" LIMIT 3
---
  def index
    @user = User.new
    @posts = Post.search(params[:search], params[:page]).take(3)
    @projects = Project.search(params[:search], params[:page]).take(3)